In [1]:
import numpy as np 
import pandas as pd

/var/folders/kq/22rtshv9635518wrmfbx3l1r0000gn/T/ipykernel_57587/684131375.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
original_list = [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]

result = sorted(original_list, key=lambda i: 0 if i == 0 else -1/ i)
print(result)

[2, 4, 6, 8, 10, 12, -11, -9, -7, -5, -3, -1]

In [4]:
data_df = pd.read_csv("JEOPARDY_DATA.csv")
data_df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [5]:
data_df.dtypes

Show Number     int64
 Air Date      object
 Round         object
 Category      object
 Value         object
 Question      object
 Answer        object
dtype: object

In [6]:
data_df.columns = ['ShowNumber', 'AirDate', 'Round','Category', 'Value','Question', 'Answer']

data_df.columns = data_df.columns.str.strip()
data_df = pd.get_dummies(data_df, columns=['Round'])

In [7]:
data_df.head()

,ShowNumber,AirDate,Category,Value,Question,Answer,Round_Double Jeopardy!,Round_Final Jeopardy!,Round_Jeopardy!,Round_Tiebreaker
0,4680,12/31/2004,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus,False,False,True,False
1,4680,12/31/2004,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,False,False,True,False
2,4680,12/31/2004,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona,False,False,True,False
3,4680,12/31/2004,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's,False,False,True,False
4,4680,12/31/2004,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams,False,False,True,False

In [8]:
data_df['Value']=data_df['Value'].str.replace('$','').str.replace(',','').str.replace(' ','')

In [9]:
data_df['Value'] = data_df['Value'].astype(float)

In [10]:
data_df.dtypes

ShowNumber                  int64
AirDate                    object
Category                   object
Value                     float64
Question                   object
Answer                     object
Round_Double Jeopardy!       bool
Round_Final Jeopardy!        bool
Round_Jeopardy!              bool
Round_Tiebreaker             bool
dtype: object